Тест/Тест/src/InformationRegisters/ИндНомер/ИндНомер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИндНомер</name>
  <resources>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>наценка</name>
    <type>
      <types>CatalogRef.Коофициенты</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>цп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>дн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>п</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>АвитоЧастник</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоНовыйИндКод</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Стеллаж</name>
    <type>
      <types>CatalogRef.Стеллаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПроверена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.МоделиАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияКонвеера</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьФото</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.Состояние</types>
    </type>
  </attributes>
  <attributes>
    <name>Поддон</name>
    <type>
      <types>CatalogRef.Поддоны</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураДляПоиска</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подкатегория</name>
    <type>
      <types>CatalogRef.Категории</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеСлова</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНаличия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактНаличия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаНаличие</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетальКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверкиЕстьВНаличии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЕстьВНаличии</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАвтозагрузкеАвито</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/Enums/ЭтапыПродажи/ЭтапыПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭтапыПродажи</name>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>НоваяЗаявка</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Контроль</name>
  </enumValues>
  <enumValues>
    <name>Собрать</name>
  </enumValues>
  <enumValues>
    <name>Собрано</name>
  </enumValues>
  <enumValues>
    <name>Оформление</name>
  </enumValues>
  <enumValues>
    <name>Оформлено</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>Упаковано</name>
  </enumValues>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Выдать</name>
  </enumValues>
  <enumValues>
    <name>Выдано</name>
  </enumValues>
</mdclass:Enum>

Тест/Тест/src/Enums/дт_ТипыКлиентов/дт_ТипыКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>дт_ТипыКлиентов</name>
  <enumValues>
    <name>ФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ИП</name>
  </enumValues>
</mdclass:Enum>

Тест/Тест/src/CommonModules/ЭтапированиеЗаявки/Module.bsl
Функция ЭтапированиеЗаявки(Заявка,Ссылка = Неопределено) ЭКСПОРТ
	Если ЗначениеЗаполнено(Ссылка) ТОгда  
		Заявка = Ссылка.ПолучитьОбъект();
	КонецЕсли;	
ТекущийЭтап = Заявка.ЭтапыПродажи; 
		
Если Заявка.ЭтапыПродажи = Перечисления.ЭтапыПродажи.Отказ Тогда 
	 Возврат Перечисления.ЭтапыПродажи.Отказ;   
КонецЕсли; 

Если ЗначениеЗаполнено(Заявка.Продажа) Тогда /// Если Есть продажа то строим запросы к ней
	ОбъектПродажа = Заявка.Продажа.ПолучитьОбъект(); 
	КолТоваров	= ОбъектПродажа.Таблица.Количество(); 

		Если КолТоваров >  0 Тогда 
			Флаг = ложь; // Если Истина то разрешено сверять место хранения детали и полки менеджера
			Флаг2 = ложь;// Если Истина то разрешено Проверять выдачу или отмену товара
			
			ПроверкаСобрано 	= Ложь; 
			ПроверкаВыдано 		= ложь; 	 
			ПроверкаОформлено 	= Ложь; 
			ПроверкаОтправлено 	= ложь; 
			
			Запрос = Новый Запрос;
			Запрос.Текст =
					"ВЫБРАТЬ
					|	ПродажаЗапчастейТаблица.Товар.Наименование КАК НоменклатураНаименование,
					|	ПродажаЗапчастейТаблица.Ссылка.КтоПродал КАК Менеджер
					|ИЗ
					|	Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
					|ГДЕ
					|	ПродажаЗапчастейТаблица.Ссылка.ЗаказКлиента = &Ссылка
					|	И (ПродажаЗапчастейТаблица.Партия = ЗНАЧЕНИЕ(Справочник.ИндКод.ПустаяСсылка)
					|	ИЛИ ПродажаЗапчастейТаблица.Заменить = ИСТИНА)"; 	
			
			Запрос.УстановитьПараметр("Ссылка",Заявка.Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда  
				Флаг = истина; 
			КонецЕсли; 
			
			Если Флаг Тогда 
				
				Запрос = Новый Запрос;
				Запрос.Текст =
						"ВЫБРАТЬ
						|	ПродажаЗапчастейТаблица.Партия
						|ПОМЕСТИТЬ ВТ_Партии
						|ИЗ
						|	Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
						|ГДЕ
						|	ПродажаЗапчастейТаблица.Ссылка.ЗаказКлиента = &Ссылка
						|	И ПродажаЗапчастейТаблица.Партия <> ЗНАЧЕНИЕ(Справочник.ИндКод.ПустаяСсылка)
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ИндНомер.индкод,
						|	ИндНомер.Стеллаж
						|ИЗ
						|	РегистрСведений.ИндНомер КАК ИндНомер
						|ГДЕ
						|	НЕ ИндНомер.Стеллаж.Наименование  ПОДОБНО ""Korzina"" + ""%""
						|	И ИндНомер.индкод В
						|		(ВЫБРАТЬ
						|			ВТ_Партии.Партия
						|		ИЗ
						|			ВТ_Партии КАК ВТ_Партии)"; 	
				
				Запрос.УстановитьПараметр("Ссылка",Заявка.Ссылка);
				РезультатЗапроса = Запрос.Выполнить();
				Если РезультатЗапроса.Пустой() Тогда 
					Этап =  Перечисления.ЭтапыПродажи.Собрано;
					ПроверкаСобрано = Истина;
					Флаг2 = Истина;    
				КонецЕсли; 	
			КонецЕсли; 
			
			Запрос = Новый Запрос;
					Запрос.Текст =
						"ВЫБРАТЬ
						|	ПродажаЗапчастейТаблица.Товар.Наименование КАК НоменклатураНаименование,
						|	ПродажаЗапчастейТаблица.Ссылка.КтоПродал КАК Менеджер
						|ИЗ
						|	Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
						|ГДЕ
						|	ПродажаЗапчастейТаблица.Ссылка.ЗаказКлиента = &Ссылка
						|	И ПродажаЗапчастейТаблица.Отменено = ЛОЖЬ
						|	И ПродажаЗапчастейТаблица.СтатусТовара = ЛОЖЬ"; 
						Запрос.УстановитьПараметр("Ссылка",Заявка.Ссылка);
						РезультатЗапроса = Запрос.Выполнить();
						
						Если РезультатЗапроса.Пустой() Тогда  
							Этап =  Перечисления.ЭтапыПродажи.Выдано;
							ПроверкаВыдано = Истина;
						КонецЕсли; 
			
			Запрос = Новый Запрос;
			Запрос.Текст =
					"ВЫБРАТЬ
					|	ЗаказКлиента.РаспечатанНаряднаДоставку,
					|	ЗаказКлиента.Ссылка,
					|	ЗаказКлиента.Организация.ЮрФизЛицо.Ссылка КАК ОООИПФИЗ
					|ПОМЕСТИТЬ ВТ_Заявка
					|ИЗ
					|	Документ.ЗаказКлиента КАК ЗаказКлиента
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ПродажаЗапчастей.НомерУПД КАК НомерУПД,
					|	ПродажаЗапчастей.ТрекНомер КАК ТрекНомер,
					|	ПродажаЗапчастей.Самовывоз КАК Самовывоз,
					|	ВТ_Заявка.РаспечатанНаряднаДоставку КАК РаспечатанНаряднаДоставку,
					|	ВТ_Заявка.ОООИПФИЗ КАК ОООИПФИЗ
					|ИЗ
					|	ВТ_Заявка КАК ВТ_Заявка
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
					|		ПО ПродажаЗапчастей.ЗаказКлиента = ВТ_Заявка.Ссылка
					|ГДЕ
					|	ВТ_Заявка.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка",Заявка.Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() ТОгда 	
				
				Выборка = РезультатЗапроса.Выбрать(); 
				
				Пока Выборка.Следующий() Цикл 
					
					ООО = Ложь; 
					Если Выборка.ОООИПФИЗ = Перечисления.дт_ТипыКлиентов.ЮрЛицо Тогда 
						ООО = Истина; 
					Иначе 
						ООО = Ложь; 
					КонецЕсли;  
					
					// Оформлнено 
					Если ЗначениеЗаполнено(Выборка.НомерУПД) И  Выборка.Самовывоз И ПроверкаВыдано И ЗначениеЗаполнено(Заявка.Организация)  Тогда 
						Этап = Перечисления.ЭтапыПродажи.Оформлено;
						ПроверкаОформлено = Истина;
					КонецЕсли ; 
					// Оформлнено 
					Если Выборка.Самовывоз  И ООО = Ложь И ЗначениеЗаполнено(Заявка.Организация) И ПроверкаВыдано Тогда 
						Этап = Перечисления.ЭтапыПродажи.Оформлено;
						ПроверкаОформлено = Истина; 
					КонецЕсли ; 
					// Оформлнено 	
					Если Заявка.РаспечатанНаряднаДоставку  И ООО = Ложь И ЗначениеЗаполнено(Заявка.Организация) И ПроверкаВыдано Тогда 
						Этап = Перечисления.ЭтапыПродажи.Оформлено;
						ПроверкаОформлено = Истина; 
					КонецЕсли ; 
					// Оформлнено 		
					Если ЗначениеЗаполнено(Выборка.НомерУПД) И  Заявка.РаспечатанНаряднаДоставку И ПроверкаВыдано  Тогда 
						Этап = Перечисления.ЭтапыПродажи.Оформлено;
						ПроверкаОформлено = Истина;
					КонецЕсли ; 
					// Отправлено		
					Если ПроверкаОформлено И (Выборка.Самовывоз)   Тогда 
						Этап = Перечисления.ЭтапыПродажи.Отправлено;
						ПроверкаОтправлено = Истина;
					КонецЕсли ; 
					// Отправлено	
					Если  Выборка.Самовывоз И ПроверкаОформлено Тогда 
						Этап = Перечисления.ЭтапыПродажи.Отправлено;
						ПроверкаОтправлено = Истина; 
					КонецЕсли ; 
					// Отправлено	
					Если  ЗначениеЗаполнено(Выборка.ТрекНомер) И ПроверкаОформлено  Тогда 
						Этап = Перечисления.ЭтапыПродажи.Отправлено;
						ПроверкаОтправлено = Истина;
					КонецЕсли ; 
					//--------------------------------------------------------------------------------------------------
					//Все что ниже это логика отщелкивания работаящаяя на Клиенте
					
					// Выдать
					Если  ТекущийЭтап = Перечисления.ЭтапыПродажи.Выдать И ПроверкаВыдано = Ложь Тогда  
						Этап = Перечисления.ЭтапыПродажи.Выдать; 	
					КонецЕСли; 
					// Выдать
					Если НЕ ЗначениеЗаполнено(Этап) И ТекущийЭтап = Перечисления.ЭтапыПродажи.Выдать Тогда 
						Этап = Перечисления.ЭтапыПродажи.Выдать;
					КонецЕСли;
					
					// Собрать 
					Если НЕ ЗначениеЗаполнено(Этап) И ТекущийЭтап = Перечисления.ЭтапыПродажи.Собрать Тогда 
						Этап = Перечисления.ЭтапыПродажи.Собрать ;
					КонецЕСли; 
					 
					// В Работе
					Если НЕ ЗначениеЗаполнено(Этап) И НЕ ТекущийЭтап = Перечисления.ЭтапыПродажи.Собрать И НЕ ТекущийЭтап = Перечисления.ЭтапыПродажи.Выдать Тогда 
						Этап = Перечисления.ЭтапыПродажи.ВРаботе;
					КонецЕСли;
				КонецЦикла; 	
			КонецЕсли; 
		Иначе 
			Этап = Перечисления.ЭтапыПродажи.ВРаботе;
		КонецЕсли; 

Иначе // Если нет продажи работаем с заявкой
	
			ФлагНетПартии = ложь; 			 
			МассивПартий = Новый Массив;			
			Если Заявка.Товары.Количество() >  0 Тогда  
				Для Каждого Строка ИЗ Заявка.Товары  Цикл
					Если  Строка.Партия = Справочники.ИндКод.ПустаяСсылка() ИЛИ Строка.Заменить Тогда 
						ФлагНетПартии = Истина; 
					Иначе
						МассивПартий.Добавить(Строка.Партия);   
					КонецЕСли; 
					
				КонецЦикла; 
						
				Если НЕ ФлагНетПартии И МассивПартий.Количество() > 0 Тогда 
					
					Запрос = Новый Запрос;
					Запрос.Текст =
							"ВЫБРАТЬ
							|	ИндНомер.индкод КАК индкод,
							|	ИндНомер.Стеллаж КАК Стеллаж
							|ИЗ
							|	РегистрСведений.ИндНомер КАК ИндНомер
							|ГДЕ
							|	НЕ ИндНомер.Стеллаж.Наименование ПОДОБНО ""Korzina"" + ""%""
							|	И ИндНомер.индкод В(&МасивПартий)"; 	
					
					Запрос.УстановитьПараметр("МасивПартий",МассивПартий);
					РезультатЗапроса = Запрос.Выполнить();
					
					Если РезультатЗапроса.Пустой() Тогда 
						Этап =  Перечисления.ЭтапыПродажи.Собрано; 
					КонецЕсли; 	
					
				КонецЕсли; 
				
					Если НЕ ЗначениеЗаполнено(Этап) И ТекущийЭтап = Перечисления.ЭтапыПродажи.Собрать Тогда 
						Этап = Перечисления.ЭтапыПродажи.Собрать;
					КонецЕСли; 
					
					Если НЕ ЗначениеЗаполнено(Этап) И ТекущийЭтап = Перечисления.ЭтапыПродажи.Выдать Тогда 
						Этап = Перечисления.ЭтапыПродажи.Выдать;
					КонецЕСли;
					
					Если НЕ ЗначениеЗаполнено(Этап) И НЕ ТекущийЭтап = Перечисления.ЭтапыПродажи.Собрать Тогда 
						Этап = Перечисления.ЭтапыПродажи.ВРаботе;
					КонецЕСли;
			Иначе 
				Этап = Перечисления.ЭтапыПродажи.ВРаботе;		
			КонецЕсли;  		
КонецЕсли; 

Возврат Этап;
 
КонецФункции
